In [3]:
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer, MissingIndicator

In [4]:
df = pd.read_csv("titanic.csv", usecols=["Age", "Fare", "Survived"])

In [3]:
df.head()

   Survived   Age     Fare
0         0  22.0   7.2500
1         1  38.0  71.2833
2         1  26.0   7.9250
3         1  35.0  53.1000
4         0  35.0   8.0500

In [4]:
df.isnull().sum()

Survived      0
Age         177
Fare          0
dtype: int64

In [12]:
# in percentage:
df.isnull().mean()*100

Survived     0.00000
Age         19.86532
Fare         0.00000
dtype: float64

In [13]:
x = df.drop(columns=["Survived"])
y = df["Survived"]

In [21]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.3, random_state=None)

In [22]:
x_train.head()

      Age     Fare
503  37.0   9.5875
416  34.0  32.5000
384   NaN   7.8958
697   NaN   7.7333
705  39.0  26.0000

In [28]:
mi = MissingIndicator()

In [29]:
x_train["Age_NA"] = mi.fit_transform(x_train)

In [31]:
x_test["Age_NA"] = mi.fit_transform(x_test)

In [33]:
x_train.head()

      Age     Fare  Age_NA
503  37.0   9.5875   False
416  34.0  32.5000   False
384   NaN   7.8958    True
697   NaN   7.7333    True
705  39.0  26.0000   False

## Now on house_price

In [34]:
df = pd.read_csv("house_price.csv", usecols=["GarageQual", "FireplaceQu", "SalePrice"])

In [35]:
df.head()

  FireplaceQu GarageQual  SalePrice
0         NaN         TA     208500
1          TA         TA     181500
2          TA         TA     223500
3          Gd         TA     140000
4          TA         TA     250000

In [37]:
df.isnull().mean()*100

FireplaceQu    47.260274
GarageQual      5.547945
SalePrice       0.000000
dtype: float64

In [41]:
df["FireplaceQu_NA"] = mi.fit_transform(df[["FireplaceQu"]])
df["GarageQual_NA"] = mi.fit_transform(df[["GarageQual"]])

In [45]:
df.sample(5)

    FireplaceQu GarageQual  SalePrice  FireplaceQu_NA  GarageQual_NA
17          NaN         TA      90000            True          False
620         NaN        NaN      67000            True           True
523          Gd         TA     184750           False          False
626          TA         TA     139900           False          False
794          TA         TA     194500           False          False

In [46]:
x = df.drop(columns=["SalePrice"])
y = df["SalePrice"]

In [47]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.3, random_state=None)

In [48]:
x_train.head()

    FireplaceQu GarageQual  FireplaceQu_NA  GarageQual_NA
871         NaN         TA            True          False
991          Gd         TA           False          False
915         NaN         TA            True          False
922          Gd         TA           False          False
320         NaN         TA            True          False

## without using missingIndicator:

In [5]:
si = SimpleImputer(add_indicator=True)

In [21]:
df_transformed = pd.DataFrame(si.fit_transform(df), columns=["FireplaceQu_NA", "FireplaceQu", "GarageQual", "GarageQual_NA"])

In [22]:
df_transformed.sample(5)

     FireplaceQu_NA  FireplaceQu  GarageQual  GarageQual_NA
177             0.0    50.000000     28.7125            0.0
742             1.0    21.000000    262.3750            0.0
619             0.0    26.000000     10.5000            0.0
468             0.0    29.699118      7.7250            1.0
512             1.0    36.000000     26.2875            0.0